Revit 2024 API
TransmittedModelOptions Enumeration
 Enum giving desired behavior when opening or saving a transmitted workshared model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Since: 2013
Syntax
C#
public enum TransmittedModelOptions
Visual Basic
Public Enumeration TransmittedModelOptions
Visual C++
public enum class TransmittedModelOptions
Members
Member name | Description
SaveAsNewCentral |  The model should be saved as a new central. (On open, it will be saved as a new central in its current location. On save, it will be saved as central but the user can choose a location.)
KeepAsTransmitted |  The model will remain marked as transmitted; users will not be able to create locals until it is saved as a new central.
CancelOperation |  Cancel the save or load operation.
See Also
Autodesk.Revit.DB Namespace